# Câu 1: Cho dữ liệu employees1.csv và employees2.csv 
* Đọc dữ liệu từ 2 tập tin trên 
* Kết hợp 2 dữ liệu trên thành 1 DataFrame 
# Câu 2: Cho dữ liệu department.csv 
* Đọc dữ liệu từ tập tin trên 
* Kết hợp dữ liệu này với dữ liệu kết quả từ câu 1 
# Câu 3: Cho dữ liệu skills.csv 
* Đọc dữ liệu từ tập tin trên 
* Kết hợp dữ liệu này với dữ liệu kết quả từ câu 2
# Câu 4: Cho dữ liệu salary.csv 
* Đọc dữ liệu từ tập tin trên 
* Kết hợp dữ liệu này với dữ liệu ở câu 1 (gợi ý: dùng right_on & left_on khi merge vì trong salay có cột name, còn df ở câu 1 lại có cột employee trùng nội dung, bỏ cột name) 
# Câu 1+: Cho dữ liệu employees1.csv và employees2.csv 
* Đọc dữ liệu từ 2 tập tin trên vào 2 DataFrame với index của các DataFrame là 'employee' 
* Kết hợp 2 DataFrame trên thành 1 DataFrame dùng chung 1 index là 'employee' (gợi ý: dùng left_index hoặc/và right_index hoặc dùng dataframe1.join(dataframe2))
# Câu 5: Cho dữ liệu như sau: 
1. df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'], 'food': ['fish', 'beans', 'bread']}, columns= ['name', 'food']) 
2. df7 = pd.DataFrame({'name': ['Mary', 'Joseph'], 'drink': ['wine', 'beer']}, columns=['name', 'drink']) 
- Kết hợp 2 bộ dữ liệu này với tham số how='inner', how='outer', how='left', how='right'. 
Quan sát kết quả trong từng trường hợp.

# Câu 6: Cho dữ liệu như sau: 
1. df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank': [1, 2, 3, 4]}) 
2. df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank': [3, 1, 4, 2]}) 
- Kết hợp 2 bộ dữ liệu này với tham số on='tên_cột_trùng_lắp' và/hoặc suffixes=["_L", "_R"]

In [2]:
import pandas as pd
import glob as gl

In [5]:
# allFile1 = gl.glob("employees*.csv")
# df_lst = []
# for ten_file in allFile1:
#     df = pd.read_csv(ten_file,header=0,index_col=0)
#     print(ten_file,df.shape)
#     df.columns = map(str.upper,df.columns)
#     df_lst.append(df)

employees1.csv (6, 2)
employees2.csv (6, 2)

In [20]:
df1 = pd.read_csv('employees1.csv',index_col=0)
df2 = pd.read_csv('employees2.csv',index_col=0)
df = pd.merge(df1,df2)
df

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
4     John           IT       2010
5    Billy           HR       2015

In [21]:
df_dept = pd.read_csv('department.csv',index_col=0)
df_dept

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
3           IT       Jame

In [22]:
df_with_dept = pd.merge(df,df_dept)
df_with_dept

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve
4    Billy           HR       2015      Steve
5     John           IT       2010       Jame

In [23]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank': [1, 2, 3, 4]}) 
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'rank': [3, 1, 4, 2]})

In [24]:
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [25]:
df = pd.merge(df8,df9,on='name')
df

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [27]:
df = pd.merge(df8,df9,on='name',suffixes=['_L','_R'])
df

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2